c2m3-assignment/app/controllers/todo_items_controller.rb

SELECT "todo_items".* FROM "todo_items"
---
  def index
    @todo_items = TodoItem.all

INSERT INTO "todo_items" ("title", "description", "completed", "due_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "fsdf"], ["description", "dsfs"], ["completed", "f"], ["due_date", "2018-05-24"], ["created_at", "2018-05-24 19:50:18.775760"], ["updated_at", "2018-05-24 19:50:18.775760"]]
---
  def create
    @todo_item = TodoItem.new(todo_item_params)

    respond_to do |format|
      if @todo_item.save

UPDATE "todo_items" SET "completed" = ?, "updated_at" = ? WHERE "todo_items"."id" = ?  [["completed", "t"], ["updated_at", "2018-05-24 20:13:04.412766"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @todo_item.update(todo_item_params)

DELETE FROM "todo_items" WHERE "todo_items"."id" = ?  [["id", 5]]
---
  def destroy
    @todo_item.destroy

SELECT  "todo_items".* FROM "todo_items" WHERE "todo_items"."id" = ? LIMIT 1  [["id", 5]]
---
    def set_todo_item
      @todo_item = TodoItem.find(params[:id])